Repository: alexandrefscampos/tcc
Catalog: lib/l10n/app_*.arb
Languages: pt

# appTitle
source: Flutter Flex Frog
pt: Flutter Sapo Flex

# levelSelectTitle
source: Flutter Flex Frog - Levels
pt: Flutter Sapo Flex - Níveis

source: Level {number}
pt: Nível {number}

source: Congratulations! 🎉
pt: Parabéns! 🎉

# levelCompleted
source: You've completed level {number}!
pt: Você completou o nível {number}!

source: Next Level
pt: Próximo Nível

source: 🏆 Game Complete! 🏆
pt: 🏆 Jogo Completo! 🏆

# gameCompleteMessage
source: Congratulations! You've mastered Flutter layouts!
pt: Parabéns! Você dominou os layouts do Flutter!

source: Play Again
pt: Jogar Novamente

# resetTooltip
source: Reset to original code
pt: Resetar para código original

# formatTooltip
source: Format code
pt: Formatar código

# codeHint
source: Enter your Flutter layout code here...
pt: Digite seu código de layout Flutter aqui...

source: Checking solution...
pt: Verificando solução...

# codeFormattingFailed
source: Code formatting failed - please check your syntax
pt: Formatação do código falhou - verifique sua sintaxe

# level1Instructions
source: Center the frogs vertically using Column and mainAxisAlignment.
pt: Centralize os sapos verticalmente usando Column e mainAxisAlignment.

# level1Explanation
source: Column widgets arrange their children vertically. mainAxisAlignment controls the vertical positioning.
pt: Widgets Column organizam seus filhos verticalmente. mainAxisAlignment controla o posicionamento vertical.

# level2Instructions
source: Center the frogs horizontally using Row and mainAxisAlignment.
pt: Centralize os sapos horizontalmente usando Row e mainAxisAlignment.

# level2Explanation
source: Row widgets arrange their children horizontally. mainAxisAlignment controls the horizontal positioning.
pt: Widgets Row organizam seus filhos horizontalmente. mainAxisAlignment controla o posicionamento horizontal.

# level3Instructions
source: Distribute the frogs evenly using Row and mainAxisAlignment.
pt: Distribua os sapos uniformemente usando Row e mainAxisAlignment.

# level3Explanation
source: Use spaceEvenly to distribute widgets with equal spacing around them.
pt: Use spaceEvenly para distribuir widgets com espaçamento igual ao redor deles.

# level4Instructions
source: Arrange the frogs horizontally with equal spacing using Row and mainAxisAlignment.
pt: Organize os sapos horizontalmente com espaçamento igual usando Row e mainAxisAlignment.

# level4Explanation
source: Row widgets arrange their children horizontally. Use spaceBetween to distribute them with equal spacing.
pt: Widgets Row organizam seus filhos horizontalmente. Use spaceBetween para distribuí-los com espaçamento igual.

# level5Instructions
source: Position the frogs at the bottom using Column and mainAxisAlignment.
pt: Posicione os sapos na parte inferior usando Column e mainAxisAlignment.

# level5Explanation
source: Use mainAxisAlignment: MainAxisAlignment.end to position items at the bottom of a Column.
pt: Use mainAxisAlignment: MainAxisAlignment.end para posicionar itens na parte inferior de uma Column.

# level6Instructions
source: Center the frogs both horizontally and vertically using nested Column and Row.
pt: Centralize os sapos tanto horizontal quanto verticalmente usando Column e Row aninhados.

# level6Explanation
source: You can nest Row inside Column to control both horizontal and vertical alignment.
pt: Você pode aninhar Row dentro de Column para controlar tanto o alinhamento horizontal quanto vertical.

# level7Instructions
source: Position the frogs at the bottom with equal spacing using nested widgets.
pt: Posicione os sapos na parte inferior com espaçamento igual usando widgets aninhados.

# level7Explanation
source: Combine Column and Row with different alignment properties to achieve complex layouts.
pt: Combine Column e Row com diferentes propriedades de alinhamento para conseguir layouts complexos.

# level8Instructions
source: Arrange the frogs vertically using Column.
pt: Organize os sapos verticalmente usando Column.

# level8Explanation
source: Column widgets arrange their children vertically from top to bottom.
pt: Widgets Column organizam seus filhos verticalmente de cima para baixo.

# level9Instructions
source: Position the frogs at the bottom using Flex and direction properties.
pt: Posicione os sapos na parte inferior usando Flex e propriedades de direção.

# level9Explanation
source: Flex widgets can be configured to work like Row or Column using the direction property.
pt: Widgets Flex podem ser configurados para funcionar como Row ou Column usando a propriedade direction.

# syntaxErrorInvalidWidget
source: Invalid syntax: Please use a valid Flutter widget format like "row(...)" or "column(...)" or "flex(...)"
pt: Sintaxe inválida: Use um formato válido de widget Flutter como "row(...)" ou "column(...)" ou "flex(...)"

# syntaxErrorUnknownWidget
source: Invalid widget: "{widgetName}" is not a valid Flutter widget. Use "row" or "column" or "flex".
pt: Widget inválido: "{widgetName}" não é um widget Flutter válido. Use "row" ou "column" ou "flex".

# syntaxErrorMismatchedParentheses
source: Syntax error: Mismatched parentheses in your code.
pt: Erro de sintaxe: Parênteses desbalanceados no seu código.

# syntaxErrorMissingBrackets
source: Syntax error: Children must be enclosed in square brackets [...].
pt: Erro de sintaxe: Children devem estar dentro de colchetes [...].

# syntaxErrorMissingCommaAfterMainAxis
source: Missing comma after mainAxisAlignment. Example: "mainAxisAlignment: start,"
pt: Vírgula faltando após mainAxisAlignment. Exemplo: "mainAxisAlignment: start,"

# syntaxErrorMissingCommaAfterCrossAxis
source: Missing comma after crossAxisAlignment. Example: "crossAxisAlignment: start,"
pt: Vírgula faltando após crossAxisAlignment. Exemplo: "crossAxisAlignment: start,"

# syntaxErrorMissingCommaAfterDirection
source: Missing comma after direction. Example: "direction: horizontal,"
pt: Vírgula faltando após direction. Exemplo: "direction: horizontal,"

# syntaxErrorMissingCommaBetweenProperties
source: Missing comma between properties. Each property should end with a comma.
pt: Vírgula faltando entre propriedades. Cada propriedade deve terminar com vírgula.

# syntaxErrorMissingCommaAfterChildren
source: Missing comma after children array. Example: "children: [frog()],"
pt: Vírgula faltando após array de children. Exemplo: "children: [frog()],"

# syntaxErrorMissingColon
source: Missing colon after property name. Example: "direction: horizontal"
pt: Dois pontos faltando após nome da propriedade. Exemplo: "direction: horizontal"

# syntaxErrorInvalidAlignment
source: Invalid alignment value "{value}". Use: start, end, center, spaceBetween, spaceAround, or spaceEvenly.
pt: Valor de alinhamento inválido "{value}". Use: start, end, center, spaceBetween, spaceAround, ou spaceEvenly.

# syntaxErrorInvalidDirection
source: Invalid direction value "{value}". Use: horizontal or vertical.
pt: Valor de direção inválido "{value}". Use: horizontal ou vertical.

# syntaxErrorMissingParentheses
source: Missing parentheses after frog. Use "frog()" instead of "frog".
pt: Parênteses faltando após frog. Use "frog()" ao invés de "frog".

# solutionIncorrectFrogCount
source: Incorrect number of frogs. Expected {expected} frogs, but found {found}.
pt: Número incorreto de sapos. Esperado {expected} sapos, mas encontrou {found}.

# solutionMismatchedCount
source: Number of frogs ({frogCount}) does not match number of lilypads ({lilypadCount}).
pt: Número de sapos ({frogCount}) não corresponde ao número de vitórias-régias ({lilypadCount}).

# solutionSuccess
source: Great job! You've completed this level!
pt: Excelente trabalho! Você completou este nível!

# solutionIncorrectPlacement
source: Not quite right. Make sure each frog is on its matching colored lilypad.
pt: Não está certo ainda. Certifique-se de que cada sapo está na vitória-régia da cor correspondente.

# solutionCodeError
source: There was an error in your code: {error}
pt: Houve um erro no seu código: {error}
